
//select_adhigaram
var kuralAdhigaram ={
    "அறத்துப்பால்": {
        "பாயிரவியல்": [
            "கடவுள் வாழ்த்து", "வான்சிறப்பு", "நீத்தார் பெருமை ", "அறன்வலியுறுத்தல் "
        ],
        "இல்லறவியல்": [
            "இல்வாழ்க்கை ", "வாழ்க்கைத் துணைநலம்", "புதல்வரைப் பெறுதல்", "அன்புடைமை ",
            "விருந்தோம்பல் ", "இனியவைகூறல்", "செய்ந்நன்றி அறிதல்", "நடுவு நிலைமை",
            "அடக்கமுடைமை ", "ஒழுக்கமுடைமை ", "பிறனில் விழையாமை ", "பொறையுடைமை "
        ],
        "துறவறவியல்": [
            "அழுக்காறாமை ", "வெஃகாமை ", "புறங்கூறாமை ", "பயனில சொல்லாமை", "தீவினையச்சம் ",
            "ஒப்புரவறிதல் ", "ஈகை ", "புகழ் ", "அருளுடைமை ", "புலான்மறுத்தல் ", "தவம் ",
            "கூடாவொழுக்கம்", "கள்ளாமை ", "வாய்மை ", "வெகுளாமை ", "இன்னாசெய்யாமை",
            "கொல்லாமை", "நிலையாமை ", "துறவு ", "மெய்யுணர்தல்", "அவாவறுத்தல் "
        ],
        "ஊழியல்": [
            "ஊழ் "
        ]
    },
    "பொருட்பால்": {
        "அரசியல்": [
            "இறைமாட்சி ", "கல்வி ", "கல்லாமை ", "கேள்வி ", "அறிவுடைமை ",
            "குற்றங்கடிதல் ", "பெரியாரைத் துணைக்கோடல்", "சிற்றினஞ்சேராமை ",
            "தெரிந்துசெயல்வகை ", "வலியறிதல் ", "காலமறிதல் ", "இடனறிதல் ",
            "தெரிந்துதெளிதல் ", "தெரிந்துவினையாடல்", "சுற்றந்தழால் ", "பொச்சாவாமை ",
            "செங்கோன்மை ", "கொடுங்கோன்மை ", "வெருவந்தசெய்யாமை ", "கண்ணோட்டம் ",
            "ஒற்றாடல் ", "ஊக்கமுடைமை ", "மடியின்மை ", "ஆள்வினையுடைமை",
            "இடுக்கணழியாமை "
        ],
        "அமைச்சியல்": [
            "அமைச்சு ", "சொல்வன்மை ", "வினைத்தூய்மை ", "வினைத்திட்பம் ",
            "வினைசெயல்வகை", "தூது ", "மன்னரைச் சேர்ந்தொழுதல்",
            "குறிப்பறிதல் ", "அவையறிதல் ", "அவையஞ்சாமை "
        ],
        "அரணியல்": [
            "நாடு", "அரண்"
        ],
        "கூழியல்": [
            "பொருள்செயல்வகை"
        ],
        "படையியல்": [
            "படைமாட்சி", "படைச்செருக்கு"
        ],
        "நட்பியல்": [
            "நட்பு ", "நட்பாராய்தல் ", "பழைமை ", "தீ நட்பு ", "கூடாநட்பு "
        ],
        "பகைமையியல்": [
            "பேதைமை ", "புல்லறிவாண்மை ", "இகல் ", "பகைமாட்சி ",
            "பகைத்திறந்தெரிதல்", "உட்பகை "
        ],
        "ஒழுக்கியல்": [
            "பெரியாரைப் பிழையாமை ", "பெண்வழிச்சேறல்",
            "வரைவின்மகளிர்", "கள்ளுண்ணாமை", "சூது ", "மருந்து "
        ],
        "குடியியல்": [
            "குடிமை ", "மானம் ", "பெருமை ", "சான்றாண்மை", "பண்புடைமை ",
            "நன்றியில்செல்வம்", "நாணுடைமை", "குடிசெயல்வகை",
            "உழவு ", "நல்குரவு ", "இரவு ", "இரவச்சம் ", "கயமை "
        ]
    },
    "காமத்துப்பால்": {
        "களவியல்": [
            "தகையணங்குறுத்தல் ", "குறிப்பறிதல்", "புணர்ச்சிமகிழ்தல் ",
            "நலம்புனைந்துரைத்தல்", "காதற்சிறப்புரைத்தல்",
            "நாணுத்துறவுரைத்தல்", "அலரறிவுறுத்தல் "
        ],
        "கற்பியல்": [
            "பிரிவாற்றாமை ", "படர்மெலிந்திரங்கல்", "கண்விதுப்பழிதல் ",
            "பசப்புறுபருவரல் ", "தனிப்படர்மிகுதி ", "நினைந்தவர்புலம்பல்",
            "கனவுநிலையுரைத்தல்", "பொழுதுகண்டிரங்கல்", "உறுப்புநலனழிதல் ",
            "நெஞ்சொடுகிளத்தல் ", "நிறையழிதல் ", "அவர்வயின்விதும்பல்",
            "குறிப்பறிவுறுத்தல் ", "புணர்ச்சிவிதும்பல்",
            "நெஞ்சொடுபுலத்தல் ", "புலவி ", "புலவி நுணுக்கம் ", "ஊடலுவகை "
        ]
    }
}


function loadDropDown() {
    var selectPal = document.getElementById("select_pal");
    var selectIyal = document.getElementById("select_iyal");
    var selectAdhigaram = document.getElementById("select_adhigaram");

    for (var pal in kuralAdhigaram) {
        selectPal.options[selectPal.options.length] = new Option(pal, pal);
    }

    selectPal.onchange = function () {
        selectIyal.length = 1; // remove all options bar first
        selectAdhigaram.length = 1; // remove all options bar first
        if (this.selectedIndex < 1) return; // done
        for (var state in kuralAdhigaram[this.value]) {
            selectIyal.options[selectIyal.options.length] = new Option(state, state);
        }
    }
    selectPal.onchange(); // reset in case page is reloaded
    selectIyal.onchange = function () {
        selectAdhigaram.length = 1; // remove all options bar first
        if (this.selectedIndex < 1) return; // done
        var district = kuralAdhigaram[selectPal.value][this.value];
        for (var i = 0; i < district.length; i++) {
            selectAdhigaram.options[selectAdhigaram.options.length] = new Option(district[i], district[i]);
        }
    }
}









